app/Models/ProductModel.php

    public function get_home_products()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('products');
        $data = $builder->limit(8)->orderBy('add_date', 'DESC')->get();
---
SELECT *
FROM `products`
ORDER BY `add_date` DESC
 LIMIT 8